app/Controllers/Tickets.php


        // Save the ticket using the model
        $ticketModel = new Ticket();
        $ticketModel->save($ticketData);
---
INSERT INTO `tickets` (`title`, `question`, `status`, `attachment`, `user_id`, `created_at`, `updated_at`) VALUES ('دخحدخهذ', 'ذخعتخعرخعر', 'open', 'uploads/tickets/1.pdf', '3', '2024-11-11 06:40:10', '2024-11-11 06:40:10')

    public function view($ticketId)
    {
        $ticketModel = new Ticket();
        $userModel = new User();
        $ticketResponse = new TicketResponse();
        // // Find the ticket by its ID
        $ticket = $ticketModel->find($ticketId);
---
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '6'

    public function respond($ticketId)
    {
        // Validate the response
        // $validation = \Config\Services::validation();
        // $validation->setRules([
        //     'response' => 'required|string|min_length[10]',
        // ]);

        // if (!$this->validate($validation->getRules())) {
        //     // If validation fails, redirect back with errors
        //     return redirect()->back()->withInput()->with('error', 'پاسخ باید حداقل 10 کاراکتر باشد.');
        // }

        // Get the current user ID (assuming it's stored in session or similar)
        $userId = session()->get('user_id');  // Replace this with actual user session retrieval

        // Save the response
        $ticketResponseModel = new TicketResponse();
        $ticketResponseModel->insert([
            'ticket_id' => $ticketId,
            'user_id'   => $userId,
            'answer'    => $this->request->getPost('response'),
        ]);
---
INSERT INTO `ticket_responses` (`ticket_id`, `user_id`, `answer`) VALUES ('3', '2', 'باید از طریق منوی ثبت دامنه اقدام نمایید.')