app/Models/TicketResponse.php

SELECT `ticket_responses`.*, `users`.`username`, `users`.`role`
FROM `ticket_responses`
JOIN `users` ON `users`.`id` = `ticket_responses`.`user_id`
WHERE `ticket_responses`.`ticket_id` = '7'
---
    public function getResponsesWithUser($ticketId)
    {
        return $this->select('ticket_responses.*, users.username, users.role')  // select user data along with ticket responses
            ->join('users', 'users.id = ticket_responses.user_id')  // join users table on user_id
            ->where('ticket_responses.ticket_id', $ticketId)  // filter by ticket_id
            ->findAll();  // return all results