app/Models/User.php

    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'erfan'
 LIMIT 1

    public function getUserById($userId)
    {
        return $this->where('id', $userId)->first();
---
SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1